micropython/micropython/ports/psoc-edge/mphalport.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2025 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

// std includes
#include "stdio.h"

// MTB includes
#include "retarget_io_init.h"

// PDL includes
#include "cy_crypto_core_trng.h"

// micropython includes
#include "mpconfigport.h"
#include "mphalport.h"

#include "py/runtime.h"

extern mtb_hal_uart_t DEBUG_UART_hal_obj;

void mp_hal_get_random(size_t n, uint8_t *buf) {
    uint32_t r = 0;
    for (size_t i = 0; i < n; i++) {
        if ((i & 3) == 0) {
            Cy_Crypto_Core_Trng_Ext(CRYPTO, 32U, &r);
        }
        buf[i] = (uint8_t)r;
        r >>= 8;
    }
}

uintptr_t mp_hal_stdio_poll(uintptr_t poll_flags) {
    printf("mp_hal_stdio_poll\n");
    mp_raise_NotImplementedError(MP_ERROR_TEXT("mp_hal_stdio_poll not implemented !"));
    uintptr_t ret = 0;
    return ret;
}

// Send string of given length
void mp_hal_stdout_tx_strn(const char *str, mp_uint_t len) {
    int r = write(STDOUT_FILENO, str, len);
    (void)r;
}

int mp_hal_stdin_rx_chr(void) {
    for (;;) {
        uint8_t c = 0;
        cy_rslt_t result;
        result = mtb_hal_uart_get(&DEBUG_UART_hal_obj, &c, 1);
        if (result == CY_RSLT_SUCCESS) {
            return c;
        }
        mp_event_handle_nowait();
    }
}

extern uint32_t get_drive_mode(uint8_t mode, uint8_t pull);

void mp_hal_pin_config(mp_hal_pin_obj_t pin, uint32_t mode, uint32_t pull, uint32_t value) {
    uint32_t drive_mode = get_drive_mode(mode, pull);
    Cy_GPIO_Pin_FastInit(Cy_GPIO_PortToAddr(pin->port), pin->pin, drive_mode, value, HSIOM_SEL_GPIO);
}

extern uint8_t pin_get_mode(const machine_pin_obj_t *self);

uint32_t mp_hal_pin_read(mp_hal_pin_obj_t pin) {
    uint8_t mode = pin_get_mode(pin);
    if (mode == GPIO_MODE_OUT ||
        mode == GPIO_MODE_OPEN_DRAIN) {
        return Cy_GPIO_ReadOut(Cy_GPIO_PortToAddr(pin->port), pin->pin);
    }
    return Cy_GPIO_Read(Cy_GPIO_PortToAddr(pin->port), pin->pin);
}

uint32_t mp_hal_pin_get_drive(mp_hal_pin_obj_t pin) {
    return Cy_GPIO_GetDriveSel(Cy_GPIO_PortToAddr(pin->port), pin->pin);
}

void mp_hal_pin_set_drive(mp_hal_pin_obj_t pin, uint32_t drive) {
    Cy_GPIO_SetDriveSel(Cy_GPIO_PortToAddr(pin->port), pin->pin, drive);
}

void mp_hal_pin_write(mp_hal_pin_obj_t pin, uint8_t polarity) {
    Cy_GPIO_Write(Cy_GPIO_PortToAddr(pin->port), pin->pin, polarity);
}

mp_hal_pin_af_obj_t mp_hal_pin_af_find(mp_hal_pin_obj_t pin, machine_pin_af_signal_t af_signal) {
    for (uint8_t i = 0; i < pin->af_num; i++) {
        const machine_pin_af_obj_t *af = &pin->af[i];
        if (af->signal == af_signal) {
            return af;
        }
    }

    mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("Pin '%q' does not support '%s'."), pin->name, machine_pin_af_signal_str[af_signal]);
}

machine_pin_af_unit_t mp_hal_periph_pins_af_get_af_unit(const mp_hal_pin_af_config_t *periph_pins_config, uint8_t num_pins) {
    bool found_first_valid_pin = false;
    machine_pin_af_periph_t periph_ptr = NULL;
    uint32_t unit = MACHINE_PIN_AF_UNIT_NONE;
    for (uint8_t i = 0; i < num_pins; i++) {
        const mp_hal_pin_af_config_t *pin_cfg = &periph_pins_config[i];
        if (pin_cfg->pin == NULL || pin_cfg->af == NULL) {
            continue;
        }
        if (!found_first_valid_pin) {
            periph_ptr = pin_cfg->af->periph;
            unit = pin_cfg->af->unit;
            found_first_valid_pin = true;
        } else {
            if (pin_cfg->af->periph != periph_ptr) {
                mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("all pins must belong to the same peripheral."));
            }
            if (pin_cfg->af->unit != unit) {
                mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("all pins must belong to the same unit."));
            }
        }
    }

    return unit;
}

void mp_hal_periph_pins_af_resolve_fn_unit(const mp_hal_pin_af_config_t *periph_pins_config, uint8_t pin_num, machine_pin_af_fn_t fn, machine_pin_af_unit_t *fn_unit) {
    uint8_t resolved_fn_unit;
    uint8_t suggested_fn_unit = *fn_unit;

    /**
     * Resolve the AF unit for the provided pins.
     * It can be that the configuration still don't have
     * any pin AF assigned.
     * Therefore, its AF unit is not yet determined.
     */
    machine_pin_af_unit_t pin_af_unit = mp_hal_periph_pins_af_get_af_unit(periph_pins_config, pin_num);

    /* No pins have been defined. */
    if (pin_af_unit == MACHINE_PIN_AF_UNIT_NONE) {
        /* The suggested AF unit candidate is chosen if defined. */
        if (suggested_fn_unit != MACHINE_PIN_AF_UNIT_NONE) {
            resolved_fn_unit = (uint8_t)suggested_fn_unit;
        } else {
            mp_raise_ValueError(MP_ERROR_TEXT("no id or pins have been provided. At least one of them must be specified."));
        }
    } else {
        /* The pins have been defined. */
        /* The suggested AF unit has been also defined.*/
        if (suggested_fn_unit != MACHINE_PIN_AF_UNIT_NONE) {
            if (suggested_fn_unit == pin_af_unit) {
                /* The suggested AF unit matches the AF unit discovered from the passed pins */
                resolved_fn_unit = (uint8_t)suggested_fn_unit;
            } else {
                mp_raise_ValueError(MP_ERROR_TEXT("the id does not match the discovered id from the provided pins."));
            }
        } else {
            /* No suggested AF unit has been passed */
            resolved_fn_unit = pin_af_unit;
        }
    }

    (*fn_unit) = resolved_fn_unit;
}

void mp_hal_periph_pins_af_resolve_pin_af(mp_hal_pin_af_config_t *periph_pins_config, uint8_t pin_num, machine_pin_af_unit_t fn_unit) {
    for (uint8_t i = 0; i < pin_num; i++) {
        if (periph_pins_config[i].af == NULL && periph_pins_config[i].pin == NULL) {
            periph_pins_config[i].pin = machine_pin_get_af_pin(fn_unit, periph_pins_config[i].signal);
            if (periph_pins_config[i].pin == NULL) {
                mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("no signal '%s' available for id %d."), machine_pin_af_signal_str[periph_pins_config[i].signal], fn_unit);
            }
            periph_pins_config[i].af = mp_hal_pin_af_find(periph_pins_config[i].pin, periph_pins_config[i].signal);
        } else {
            /**
             * It should not enter here. As this function should
             * be only called after pin - AF unit matching */
            if (periph_pins_config[i].af->unit != fn_unit && periph_pins_config[i].pin != NULL) {
                mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("the pin '%q' does not match the AF unit %d."), periph_pins_config[i].pin->name, fn_unit);
            }
        }
    }
}

machine_pin_af_periph_t mp_hal_periph_pins_af_init(const mp_hal_pin_af_config_t *periph_pins_config, uint8_t num_pins) {
    for (uint8_t i = 0; i < num_pins; i++) {
        const mp_hal_pin_af_config_t *pin_cfg = &periph_pins_config[i];
        Cy_GPIO_Pin_FastInit(Cy_GPIO_PortToAddr(pin_cfg->pin->port), pin_cfg->pin->pin, pin_cfg->cy_drive_mode, pin_cfg->init_value, pin_cfg->af->idx);
    }

    return periph_pins_config[0].af->periph;
}
